nxp-mcuxpresso/mcux-sdk/devices/MIMXRT533S/mcuxpresso/startup_mimxrt533s.c
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM33
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    SecureFault_Handler,               // The secure fault handler
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
    (void (*)())0x280000,                // Image length
#else
    (void (*)())((unsigned)_image_size), // Image length
#endif
    __imghdr_imagetype,                // Image type
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    (void (*)())g_pfnVectors,              // Image load address
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

    // Chip Level - MIMXRT533S_cm33
    WDT0_IRQHandler,               // 16: Watchdog timer interrupt
    DMA0_IRQHandler,               // 17: DMA interrupt
    GPIO_INTA_IRQHandler,          // 18: GPIO Interrupt A
    GPIO_INTB_IRQHandler,          // 19: GPIO Interrupt B
    PIN_INT0_IRQHandler,           // 20: General Purpose Input/Output interrupt 0
    PIN_INT1_IRQHandler,           // 21: General Purpose Input/Output interrupt 1
    PIN_INT2_IRQHandler,           // 22: General Purpose Input/Output interrupt 2
    PIN_INT3_IRQHandler,           // 23: General Purpose Input/Output interrupt 3
    UTICK0_IRQHandler,             // 24: Micro-tick Timer
    MRT0_IRQHandler,               // 25: Multi-Rate Timer
    CTIMER0_IRQHandler,            // 26: Standard counter/timer CTIMER0
    CTIMER1_IRQHandler,            // 27: Standard counter/timer CTIMER1
    SCT0_IRQHandler,               // 28: SCTimer/PWM
    CTIMER3_IRQHandler,            // 29: Standard counter/timer CTIMER3
    FLEXCOMM0_IRQHandler,          // 30: FlexComm interrupt
    FLEXCOMM1_IRQHandler,          // 31: FlexComm interrupt
    FLEXCOMM2_IRQHandler,          // 32: FlexComm interrupt
    FLEXCOMM3_IRQHandler,          // 33: FlexComm interrupt
    FLEXCOMM4_IRQHandler,          // 34: FlexComm interrupt
    FLEXCOMM5_IRQHandler,          // 35: FlexComm interrupt
    FLEXCOMM14_IRQHandler,         // 36: FlexComm interrupt. Standalone SPI
    FLEXCOMM15_IRQHandler,         // 37: FlexComm interrupt. Standalone I2C
    ADC0_IRQHandler,               // 38: Analog-to-Digital Converter interrupt
    Reserved39_IRQHandler,         // 39: Reserved interrupt
    ACMP_IRQHandler,               // 40: Analog comparator Interrupts
    DMIC0_IRQHandler,              // 41: Digital Microphone Interface interrupt
    Reserved42_IRQHandler,         // 42: Reserved interrupt
    HYPERVISOR_IRQHandler,         // 43: Hypervisor interrupt
    SECURE_VIOLATION_IRQHandler,   // 44: Secure violation interrupt
    HWVAD0_IRQHandler,             // 45: Hardware Voice Activity Detector interrupt
    Reserved46_IRQHandler,         // 46: Reserved interrupt
    RNG_IRQHandler,                // 47: Random Number Generator interrupt
    RTC_IRQHandler,                // 48: Real Time Clock Alarm interrupt OR Wakeup timer interrupt
    Reserved49_IRQHandler,         // 49: Reserved interrupt
    MU_A_IRQHandler,               // 50: Messaging Unit - Side A
    PIN_INT4_IRQHandler,           // 51: General Purpose Input/Output interrupt 4
    PIN_INT5_IRQHandler,           // 52: General Purpose Input/Output interrupt 5
    PIN_INT6_IRQHandler,           // 53: General Purpose Input/Output interrupt 6
    PIN_INT7_IRQHandler,           // 54: General Purpose Input/Output interrupt 7
    CTIMER2_IRQHandler,            // 55: Standard counter/timer CTIMER2
    CTIMER4_IRQHandler,            // 56: Standard counter/timer CTIMER4
    OS_EVENT_IRQHandler,           // 57: Event timer M33 Wakeup/interrupt
    FLEXSPI0_FLEXSPI1_IRQHandler,  // 58: FlexSPI0_IRQ OR FlexSPI1_IRQ
    FLEXCOMM6_IRQHandler,          // 59: FlexComm interrupt
    FLEXCOMM7_IRQHandler,          // 60: FlexComm interrupt
    USDHC0_IRQHandler,             // 61: USDHC interrupt
    USDHC1_IRQHandler,             // 62: USDHC interrupt
    SGPIO_INTA_IRQHandler,         // 63: Secure GPIO HS interrupt 0
    SGPIO_INTB_IRQHandler,         // 64: Secure GPIO HS interrupt 1
    I3C0_IRQHandler,               // 65: Improved Inter Integrated Circuit 0 interrupt
    USB0_IRQHandler,               // 66: USB device
    USB0_NEEDCLK_IRQHandler,       // 67: USB Activity Wake-up Interrupt
    WDT1_IRQHandler,               // 68: Watchdog timer 1 interrupt
    USB_PHYDCD_IRQHandler,         // 69: USBPHY DCD interrupt
    DMA1_IRQHandler,               // 70: DMA interrupt
    PUF_IRQHandler,                // 71: QuidKey interrupt
    POWERQUAD_IRQHandler,          // 72: Powerquad interrupt
    CASPER_IRQHandler,             // 73: Caspar interrupt
    PMU_PMIC_IRQHandler,           // 74: Power Management Control interrupt
    HASHCRYPT_IRQHandler,          // 75: SHA interrupt
    FLEXCOMM8_IRQHandler,          // 76: FlexComm interrupt
    FLEXCOMM9_IRQHandler,          // 77: FlexComm interrupt
    FLEXCOMM10_IRQHandler,         // 78: FlexComm interrupt
    FLEXCOMM11_IRQHandler,         // 79: FlexComm interrupt
    FLEXCOMM12_IRQHandler,         // 80: FlexComm interrupt
    FLEXCOMM13_IRQHandler,         // 81: FlexComm interrupt
    FLEXCOMM16_IRQHandler,         // 82: FlexComm interrupt
    I3C1_IRQHandler,               // 83: Improved Inter Integrated Circuit 1 interrupt
    FLEXIO_IRQHandler,             // 84: Flexible I/O interrupt
    Reserved85_IRQHandler,         // 85: Reserved interrupt
    Reserved86_IRQHandler,         // 86: Reserved interrupt
    Reserved87_IRQHandler,         // 87: Reserved interrupt
    Reserved88_IRQHandler,         // 88: Reserved interrupt
    SDMA_IRQHandler,               // 89: Smart DMA Engine Controller interrupt
}; /* End of g_pfnVectors */

#if defined(ENABLE_RAM_VECTOR_TABLE)
extern void * __VECTOR_TABLE __attribute__ ((alias ("g_pfnVectors")));
void (* __VECTOR_RAM[sizeof(g_pfnVectors) / 4])(void) __attribute__((aligned(128)));
unsigned int __RAM_VECTOR_TABLE_SIZE_BYTES = sizeof(g_pfnVectors);
#endif

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {
    // Disable interrupts
    __asm volatile ("cpsid i");
    // Config VTOR & MSPLIM register
    __asm volatile ("LDR R0, =0xE000ED08  \n"
                    "STR %0, [R0]         \n"
                    "LDR R1, [%0]         \n"
                    "MSR MSP, R1          \n"
                    "MSR MSPLIM, %1       \n"
                    :
                    : "r"(g_pfnVectors), "r"(_vStackBase)
                    : "r0", "r1");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

