nxp-mcuxpresso/mcux-sdk/devices/MIMXRT533S/mcuxpresso/startup_mimxrt533s.c
WEAK void SGPIO_INTB_IRQHandler(void)
{   SGPIO_INTB_DriverIRQHandler();
}

WEAK void I3C0_IRQHandler(void)
{   I3C0_DriverIRQHandler();
}

WEAK void USB0_IRQHandler(void)
{   USB0_DriverIRQHandler();
}

WEAK void USB0_NEEDCLK_IRQHandler(void)
{   USB0_NEEDCLK_DriverIRQHandler();
}

WEAK void WDT1_IRQHandler(void)
{   WDT1_DriverIRQHandler();
}

WEAK void USB_PHYDCD_IRQHandler(void)
{   USB_PHYDCD_DriverIRQHandler();
}

WEAK void DMA1_IRQHandler(void)
{   DMA1_DriverIRQHandler();
}

WEAK void PUF_IRQHandler(void)
{   PUF_DriverIRQHandler();
}

WEAK void POWERQUAD_IRQHandler(void)
{   POWERQUAD_DriverIRQHandler();
}

WEAK void CASPER_IRQHandler(void)
{   CASPER_DriverIRQHandler();
}

WEAK void PMU_PMIC_IRQHandler(void)
{   PMU_PMIC_DriverIRQHandler();
}

WEAK void HASHCRYPT_IRQHandler(void)
{   HASHCRYPT_DriverIRQHandler();
}

WEAK void FLEXCOMM8_IRQHandler(void)
{   FLEXCOMM8_DriverIRQHandler();
}

WEAK void FLEXCOMM9_IRQHandler(void)
{   FLEXCOMM9_DriverIRQHandler();
}

WEAK void FLEXCOMM10_IRQHandler(void)
{   FLEXCOMM10_DriverIRQHandler();
}

WEAK void FLEXCOMM11_IRQHandler(void)
{   FLEXCOMM11_DriverIRQHandler();
}

WEAK void FLEXCOMM12_IRQHandler(void)
{   FLEXCOMM12_DriverIRQHandler();
}

WEAK void FLEXCOMM13_IRQHandler(void)
{   FLEXCOMM13_DriverIRQHandler();
}

WEAK void FLEXCOMM16_IRQHandler(void)
{   FLEXCOMM16_DriverIRQHandler();
}

WEAK void I3C1_IRQHandler(void)
{   I3C1_DriverIRQHandler();
}

WEAK void FLEXIO_IRQHandler(void)
{   FLEXIO_DriverIRQHandler();
}

WEAK void Reserved85_IRQHandler(void)
{   Reserved85_DriverIRQHandler();
}

WEAK void Reserved86_IRQHandler(void)
{   Reserved86_DriverIRQHandler();
}

WEAK void Reserved87_IRQHandler(void)
{   Reserved87_DriverIRQHandler();
}

WEAK void Reserved88_IRQHandler(void)
{   Reserved88_DriverIRQHandler();
}

WEAK void SDMA_IRQHandler(void)
{   SDMA_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
